//=================1번======================

// let nums = [100, 200, 300, 400, 500];
// nums.pop();
// nums.pop();
// console.log(nums);

//=================2번======================

// pass부분에 배열 내장함수를 이용하여 코드를 입력하고 다음과 같이 출력
// 데이터
// const arr = [200, 100, 300];
//pass
// arr.splice(2, 0, 100000);
// console.log(arr);
// 200 100 100000 300

//==================3번=======================

// const arr = [100, 200, 300];
// console.log(typeof arr);
//3번 object?

// 숫자로 취급하지 않고 괄호 안에 넣음으로서
// 오브젝트 판정으로 예상됩니다.

//==================4번=======================

//2번 boolean

//==================5번=======================

let a = 10;
let b = 2;

for (let i = 1; i < 5; i += 2) {
  a += i;
}
// i는 2씩 증가 5를 넘길 수 없으니 4에서 멈추고 a = 14에서
// 멈춘다 14 + 2 는 16 답은 4번
console.log(a + b);

//==================6번=======================

//2번? 0은 정수임으로 false
//1인 것 같습니다.

//==================7번=======================

//3번 let 과 나머지는 몰라서 답안 확인했습니다.

//==================8번=======================

//나중에 선언된 것이 나오기 떄문에 84가 출력됩니다

//==================9번=======================

let result = year.concat("/", month, "/", day, hour, ":", minute, ":", second);

//==================10번======================

// 점점 늘어나는 별모양 양쪽으로 두개씩 늘어남
// 안에 입력해야하는 값이 존재함

let tree = "";

fot;
